<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"4b360efb7138752caa34f58aab0d5adfca5b849cca3319fab68c581b85ca053b","plan_job_ref":"Job Frontpage #17 at https://github.com/coverage-robot/frontpage/actions/runs/5870585109","plan_hash":"2977e4f516da41ed1d00ed253b530fb51d448313d646ad32900ab1881c1d5d9b","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.static_files["assets/index-6bc7aabd.js"] will be destroyed
  # (because key ["assets/index-6bc7aabd.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b7978e8da9bee9504b4bbd1f082cf6fe" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-6bc7aabd.js" -> null
      - key                    = "assets/index-6bc7aabd.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/index-6bc7aabd.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/index-bcafb055.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "2a852fe83f795fd7ea0719220e33dd60"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-bcafb055.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/index-bcafb055.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag                   = "1f0765b5df816fa59a34814168c808af" -> "9e3f0680abc0a11880cafaa87b337f35"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Frontpage #17](https://github.com/coverage-robot/frontpage/actions/runs/5870585109)